Repository: sidimam/unraid-drive
Catalog: Packages/UnraidGatewayKit/Sources/UnraidGatewayKit/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, it, zh_hans

source: A web page answered instead of the file (%@): usually a Cloudflare Access login. Check the service token in the server's settings.
ar: أجابت صفحة ويب بدل الملف (%@): غالبًا تسجيل دخول Cloudflare Access. تحقّق من رمز الخدمة في إعدادات الخادم.
de: Statt der Datei hat eine Webseite geantwortet (%@): meist die Cloudflare-Access-Anmeldung. Prüfen Sie das Service-Token in den Servereinstellungen.
es: Respondió una página web en lugar del archivo (%@): normalmente el inicio de sesión de Cloudflare Access. Revisa el token de servicio en los ajustes del servidor.
fr: Une page web a répondu à la place du fichier (%@) : en général la connexion Cloudflare Access. Vérifiez le jeton de service dans les réglages du serveur.
it: Ha risposto una pagina web invece del file (%@): di solito è il login di Cloudflare Access. Controlla il service token nelle impostazioni del server.
zh_hans: 返回的是网页而不是文件（%@）：通常是 Cloudflare Access 登录页。请检查服务器设置中的服务令牌。

source: Cannot reach the gateway: %@
ar: لا يمكن الوصول إلى البوابة: %@
de: Gateway nicht erreichbar: %@
es: No se puede alcanzar el gateway: %@
fr: Impossible de joindre la passerelle : %@
it: Impossibile raggiungere il gateway: %@
zh_hans: 无法连接网关：%@

source: Cloudflare Access is blocking the request. Add this server with Connection: Cloudflare Access and a valid service token, and make sure the Access policy uses the Service Auth action.
ar: يحجب Cloudflare Access الطلب. أضف هذا الخادم بوضع الاتصال Cloudflare Access ورمز خدمة صالح، وتأكد من أن سياسة Access تستخدم الإجراء Service Auth.
de: Cloudflare Access blockiert die Anfrage. Füge diesen Server mit Verbindung: Cloudflare Access und einem gültigen Service Token hinzu und stelle sicher, dass die Access-Richtlinie die Aktion Service Auth verwendet.
es: Cloudflare Access está bloqueando la petición. Añade este servidor con Conexión: Cloudflare Access y un service token válido, y asegúrate de que la política de Access use la acción Service Auth.
fr: Cloudflare Access bloque la requête. Ajoutez ce serveur avec Connexion : Cloudflare Access et un service token valide, et vérifiez que la politique Access utilise l’action Service Auth.
it: Cloudflare Access sta bloccando la richiesta. Aggiungi questo server con Connessione: Cloudflare Access e un service token valido, e verifica che la policy di Access usi l’azione Service Auth.
zh_hans: Cloudflare Access 阻止了请求。请以“连接方式：Cloudflare Access”和有效的 Service Token 添加此服务器，并确保 Access 策略使用 Service Auth 操作。

source: Not found.
ar: غير موجود.
de: Nicht gefunden.
es: No encontrado.
fr: Introuvable.
it: Non trovato.
zh_hans: 未找到。

source: Server error %lld: %@
ar: خطأ في الخادم %lld: %@
de: Serverfehler %lld: %@
es: Error del servidor %lld: %@
fr: Erreur du serveur %lld : %@
it: Errore del server %lld: %@
zh_hans: 服务器错误 %lld：%@

source: The API key, or the Unraid username and password, were rejected.
ar: تم رفض مفتاح API أو اسم مستخدم Unraid وكلمة المرور.
de: Der API-Schlüssel oder Unraid-Benutzername und -Passwort wurden abgelehnt.
es: La clave API, o el usuario y la contraseña de Unraid, fueron rechazados.
fr: La clé API, ou le nom d’utilisateur et le mot de passe Unraid, ont été refusés.
it: La chiave API, oppure utente e password Unraid, sono stati rifiutati.
zh_hans: API 密钥或 Unraid 用户名和密码被拒绝。

source: The file changed on the server.
ar: تغيّر الملف على الخادم.
de: Die Datei wurde auf dem Server geändert.
es: El archivo cambió en el servidor.
fr: Le fichier a changé sur le serveur.
it: Il file è cambiato sul server.
zh_hans: 文件在服务器上已更改。

source: The gateway answered %lld: %@
ar: أجابت البوابة %lld: %@
de: Das Gateway antwortete %lld: %@
es: El gateway respondió %lld: %@
fr: La passerelle a répondu %lld : %@
it: Il gateway ha risposto %lld: %@
zh_hans: 网关返回 %lld：%@

source: The gateway answered with JSON instead of the file: update unraid-gateway.
ar: أجابت البوابة بـ JSON بدل الملف: حدّث unraid-gateway.
de: Das Gateway antwortete mit JSON statt der Datei: unraid-gateway aktualisieren.
es: El gateway respondió con JSON en lugar del archivo: actualiza unraid-gateway.
fr: La passerelle a répondu en JSON au lieu du fichier : mettez à jour unraid-gateway.
it: Il gateway ha risposto con JSON invece del file: aggiorna unraid-gateway.
zh_hans: 网关返回了 JSON 而不是文件：请更新 unraid-gateway。

source: The gateway did not answer.
ar: لم تستجب البوابة.
de: Das Gateway hat nicht geantwortet.
es: El gateway no respondió.
fr: La passerelle n'a pas répondu.
it: Il gateway non ha risposto.
zh_hans: 网关没有响应。

source: The server URL is not valid.
ar: عنوان الخادم غير صالح.
de: Die Server-URL ist ungültig.
es: La URL del servidor no es válida.
fr: L’URL du serveur n’est pas valide.
it: L’URL del server non è valido.
zh_hans: 服务器 URL 无效。

source: The server answered with a web page instead of data (%@). A login portal or proxy is intercepting the request: check the gateway URL and the connection mode.
ar: أجاب الخادم بصفحة ويب بدلًا من البيانات (%@). بوابة تسجيل دخول أو وكيل يعترض الطلب: تحقق من عنوان البوابة ووضع الاتصال.
de: Der Server hat mit einer Webseite statt mit Daten geantwortet (%@). Ein Anmeldeportal oder Proxy fängt die Anfrage ab: Prüfe Gateway-URL und Verbindungsmodus.
es: El servidor respondió con una página web en lugar de datos (%@). Un portal de inicio de sesión o un proxy intercepta la petición: revisa la URL del gateway y el modo de conexión.
fr: Le serveur a répondu par une page web au lieu de données (%@). Un portail de connexion ou un proxy intercepte la requête : vérifiez l’URL de la passerelle et le mode de connexion.
it: Il server ha risposto con una pagina web invece dei dati (%@). Un portale di login o un proxy intercetta la richiesta: controlla l’URL del gateway e la modalità di connessione.
zh_hans: 服务器返回了网页而非数据（%@）。登录门户或代理拦截了请求：请检查网关 URL 和连接方式。

source: This device is not registered on the gateway. Open the server, choose Edit server or credentials and connect again to register it.
ar: هذا الجهاز غير مسجّل في البوابة. افتح الخادم واختر تعديل الخادم أو بيانات الاعتماد ثم اتصل مرة أخرى لتسجيله.
de: Dieses Gerät ist am Gateway nicht registriert. Öffne den Server, wähle Server oder Zugangsdaten bearbeiten und verbinde dich erneut, um es zu registrieren.
es: Este dispositivo no está registrado en el gateway. Abre el servidor, elige Editar servidor o credenciales y conecta de nuevo para registrarlo.
fr: Cet appareil n’est pas enregistré sur la passerelle. Ouvrez le serveur, choisissez Modifier le serveur ou les identifiants et reconnectez-vous pour l’enregistrer.
it: Questo dispositivo non è registrato sul gateway. Apri il server, scegli Modifica server o credenziali e collegati di nuovo per registrarlo.
zh_hans: 此设备未在网关上注册。打开服务器，选择“编辑服务器或凭据”并重新连接以注册它。

source: This device was removed from the gateway. Open the server, choose Edit server or credentials and connect again to register it.
ar: تمت إزالة هذا الجهاز من البوابة. افتح الخادم واختر تعديل الخادم أو بيانات الاعتماد ثم اتصل مرة أخرى لتسجيله.
de: Dieses Gerät wurde vom Gateway entfernt. Öffne den Server, wähle Server oder Zugangsdaten bearbeiten und verbinde dich erneut, um es zu registrieren.
es: Este dispositivo se eliminó del gateway. Abre el servidor, elige Editar servidor o credenciales y conecta de nuevo para registrarlo.
fr: Cet appareil a été retiré de la passerelle. Ouvrez le serveur, choisissez Modifier le serveur ou les identifiants et reconnectez-vous pour l’enregistrer.
it: Questo dispositivo è stato rimosso dal gateway. Apri il server, scegli Modifica server o credenziali e collegati di nuovo per registrarlo.
zh_hans: 此设备已从网关移除。打开服务器，选择“编辑服务器或凭据”并重新连接以注册它。

source: This gateway requires an Unraid username and password in addition to the API key.
ar: تتطلب هذه البوابة اسم مستخدم وكلمة مرور Unraid إضافة إلى مفتاح API.
de: Dieses Gateway verlangt zusätzlich zum API-Schlüssel einen Unraid-Benutzernamen und ein Passwort.
es: Este gateway requiere usuario y contraseña de Unraid además de la clave API.
fr: Cette passerelle exige un utilisateur et un mot de passe Unraid en plus de la clé API.
it: Questo gateway richiede utente e password Unraid oltre alla chiave API.
zh_hans: 此网关除 API 密钥外还需要 Unraid 用户名和密码。

source: Too many failed attempts. Try again in a few minutes.
ar: محاولات فاشلة كثيرة. حاول مجددًا بعد بضع دقائق.
de: Zu viele fehlgeschlagene Versuche. Versuche es in ein paar Minuten erneut.
es: Demasiados intentos fallidos. Inténtalo de nuevo en unos minutos.
fr: Trop de tentatives échouées. Réessayez dans quelques minutes.
it: Troppi tentativi falliti. Riprova tra qualche minuto.
zh_hans: 失败次数过多。请几分钟后重试。

source: Unexpected response: %@
ar: استجابة غير متوقعة: %@
de: Unerwartete Antwort: %@
es: Respuesta inesperada: %@
fr: Réponse inattendue : %@
it: Risposta inattesa: %@
zh_hans: 意外的响应：%@
